<details ><summary>plan for staging 2025-03-29 08:08:17 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project yuki-yamamura/learn-terraform#staging has been locked by PR #3
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_iam_policy.ecr_access will be created
  + resource "aws_iam_policy" "ecr_access" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "ecr-access"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:DescribeImages",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

</details>